tests/NACAAirfoil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_1
    {
        type            patch;
        physicalType    inlet;
        nFaces          400;
        startFace       79570;
    }
    outlet_2
    {
        type            patch;
        physicalType    outlet;
        nFaces          200;
        startFace       79970;
    }
    symplane_3
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80170;
    }
    wall_4
    {
        type            wall;
        inGroups        1(wall);
        nFaces          260;
        startFace       160170;
    }
)

// ************************************************************************* //
